STMicroelectronics/STM32CubeF1/Drivers/BSP/STM3210E_EVAL/stm3210e_eval_audio.c
/******************************************************************************
                            Static Function
*******************************************************************************/

/**
  * @brief  Initializes the Audio Codec audio interface (I2S)
  * @param  AudioFreq: Audio frequency to be configured for the I2S peripheral. 
  */
static void I2SOUT_Init(uint32_t AudioFreq)
{
  /* Initialize the hAudioOutI2s Instance parameter */
  hAudioOutI2s.Instance         = I2SOUT;

 /* Disable I2S block */
  __HAL_I2S_DISABLE(&hAudioOutI2s);

  /* I2SOUT peripheral configuration */
  hAudioOutI2s.Init.AudioFreq   = AudioFreq;
  hAudioOutI2s.Init.CPOL        = I2S_CPOL_LOW;
  hAudioOutI2s.Init.DataFormat  = I2S_DATAFORMAT_16B;
  hAudioOutI2s.Init.MCLKOutput  = I2S_MCLKOUTPUT_ENABLE;
  hAudioOutI2s.Init.Mode        = I2S_MODE_MASTER_TX;
  hAudioOutI2s.Init.Standard    = I2S_STANDARD;
  
  /* Initialize the I2S peripheral with the structure above */
  HAL_I2S_Init(&hAudioOutI2s);

}

/**
  * @brief  Deinitialize the Audio Codec audio interface (I2S).
  */
static void I2SOUT_DeInit(void)
{
  /* Initialize the hAudioOutI2s Instance parameter */
  hAudioOutI2s.Instance = I2SOUT;

  /* Disable I2S peripheral */
  __HAL_I2S_DISABLE(&hAudioOutI2s);

  HAL_I2S_DeInit(&hAudioOutI2s);
}

/**
  * @brief  Starts sending dummy data as audio stream: function used to 
            generate I2S master clock MCK for audio codec device.
  * @param  pBuffer: Pointer to the buffer 
  * @param  Size: Number of audio data BYTES.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
static uint8_t I2SOUT_SendDummyData_Start(uint16_t* pBuffer, uint32_t Size)
{  
  /* Update the Media layer and enable it for play */  
  HAL_I2S_Transmit_DMA(&hAudioOutI2s, pBuffer, DMA_MAX(Size));

  return AUDIO_OK;

}

/**
  * @brief  Stops sending dummy data as audio stream: function used to stop to
            generate I2S master clock MCK for audio codec device.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
static uint8_t I2SOUT_SendDummyData_Stop(void)
{
  /* Call DMA Stop to disable DMA stream before stopping codec */
  HAL_I2S_DMAStop(&hAudioOutI2s);
  
  return AUDIO_OK;

}


/**
  * @}
  */ 
 
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
